ptudor/navlistener-software/esp32/sdkconfig.defaults
# navfeeder-esp default sdkconfig. Committed; the generated `sdkconfig` is gitignored.
# Target: Waveshare ESP32-C6-LCD-1.47 (ESP32-C6, 4 MB flash, 512 KB HP SRAM).

CONFIG_IDF_TARGET="esp32c6"

# --- Flash + partitions ------------------------------------------------------
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- Clock / FreeRTOS (default) ----------------------------------------
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y
CONFIG_FREERTOS_HZ=1000

# --- Console (C6 uses the built-in USB-Serial-JTAG) --------------------------
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# --- TLS: mbedTLS floor pinned to 1.2 (GNF1) ------------
# The collector floor is TLS 1.2; we pin the ceiling to 1.2 as well to match the
# fleet and avoid TLS 1.3 post-handshake complexity on a constrained node.
CONFIG_MBEDTLS_SSL_PROTO_TLS1_2=y
# TLS 1.3 stays available in mbedTLS but the pusher requests 1.2 max at the esp-tls layer.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_HARDWARE_AES=y
CONFIG_MBEDTLS_HARDWARE_SHA=y

# --- NVS (config store) ------------------------------------------------------
CONFIG_NVS_ENCRYPTION=n

# --- Logging -----------------------------------------------------------------
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# --- Watchdog: the app must feed it; a wedged task should reboot, not hang ----
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_PANIC=y
